In [27]:
import pandas as pd

def selectData(students: pd.DataFrame) -> pd.DataFrame:
  #return students[students['student_id']==101][['name', 'age']]
  return students.loc[students['student_id']==101, ['name', 'age']]

In [28]:
selectData(df)

      name  age
0  Ulysses   13

In [17]:
filename = 'students.csv'
df = pd.read_csv(filename)
df.head()

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

In [18]:
df[df['student_id']==101][['name', 'age']]

      name  age
0  Ulysses   13

In [32]:
df.loc[df['student_id']==101, ['name', 'age']]

      name  age
0  Ulysses   13